# SQL for Data Scientist wnb
To be able to query data smoothly is a mandatory. You cannot just ask your friend to do it for you. You gotta do it your self. So here's I collect compilation about sql related posts. You have to practice it

- http://blog.yhat.com/posts/SQL-interview-questions.html
- http://blog.yhat.com/posts/summarizing-data-in-SQL.html

I use Pandas all the time and I never get exposed properly with SQL world. It's unpleasant situation since at every data science interview you will be asked about your SQL skill regardless whether you will use it in day to day work  or not (but mostly you will since most of the time the data is very big, so gotta do some aggretation in place before you can move it your own laptop to work with). Some times the interviewer doesn't even know about Pandas and even didn't know it exist. If you only tell them you can use Python but not SQL, they conclude that you cannot do data munging even tho you are excel at it with Pandas. So better prepare man! Here's something in Panda's docs that will help you learning SQL if you're in the same situation like me https://pandas.pydata.org/pandas-docs/stable/comparison_with_sql.html. The guide is actually better for people who want to learn more about Pandas after they can do SQL but it can be also the other way around. 

There are only 8 important things in data munging SQL according to the docs

1. SELECT
- WHERE
- GROUP BY & PIVOT
- JOIN
 - INNER JOIN
 - LEFT OUTER JOIN
 - RIGHT JOIN
 - FULL JOIN
- UNION
- Analytic and aggregate functions
 - Top N rows with offset
 - Top N rows per group
- UPDATE
- DELETE

Where's the pivot?

If you have done some work with Pandas, this tutorial is for you. In order to illustrate the SQL in this tutorial, I need help from Python library called sqlalchemy. You can find how to install sqlalchemy yourself and learn many more about it. In this tutorial tho, I will only use it to simulate a real database engine and do visualize the result of query in table.

In [4]:
import pandas as pd
from sqlalchemy import create_engine

In [3]:
df_p = pd.read_csv('./data/tips.csv')
df_p.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [13]:
disk_engine = create_engine('sqlite:///./data/tips.db')
df_p.to_sql('tips', disk_engine, if_exists='replace', index=False)

In [11]:
df_sql = pd.read_sql_query('SELECT * FROM tips', disk_engine)
df_sql.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

# 1. SELECT

Hope this help. PLs give me a job.